Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MM_GPM_DFP/1.3.50/atdf/PIC32MM0064GPM028.atdf
            <instance name="CLC4">
               <parameters>
                  <param name="" />
               </parameters>
            </instance>
         </module>
         <module id="01427" name="CMP" version="">
            <instance name="CMP">
               <register-group address-space="periph0" name="CMP" name-in-module="CMP" offset="0x1f802300" />
               <parameters>
                  <param name="" />
               </parameters>
            </instance>
         </module>
         <module id="00000" name="CORE" version="">
            <instance name="CORE">
               <register-group address-space="" name="CORE" name-in-module="CORE" offset="0x0" />
               <parameters>
                  <param name="" />
               </parameters>
            </instance>
         </module>
         <module id="02823" name="CRU" version="">
            <instance name="CRU">
               <register-group address-space="periph0" name="CRU" name-in-module="CRU" offset="0x1f802680" />
               <parameters>
                  <param name="" />
               </parameters>
            </instance>
         </module>
         <module id="00735" name="DMAC" version="">
            <instance name="DMAC">
               <register-group address-space="periph1" name="DMAC" name-in-module="DMAC" offset="0x1f808900" />
               <parameters>
                  <param name="" />
               </parameters>
            </instance>
         </module>
         <module id="02922" name="FUSECONFIG" version="">
            <instance name="FUSECONFIG">
               <register-group address-space="config" name="FUSECONFIG" name-in-module="FUSECONFIG" offset="0x1fc017c0" />
               <parameters>
                  <param name="" />
               </parameters>
            </instance>
         </module>
         <module id="02922" name="GPIO" version="">
            <instance name="GPIO">
               <register-group address-space="periph0" name="GPIO" name-in-module="GPIO" offset="0x1f802910" />
               <parameters>
                  <param name="" />
               </parameters>
            </instance>
         </module>
         <module id="02511" name="HLVD" version="">
            <instance name="HLVD">
               <register-group address-space="periph0" name="HLVD" name-in-module="HLVD" offset="0x1f802920" />
               <parameters>
                  <param name="" />
               </parameters>
            </instance>
         </module>
         <module id="01441" name="I2C" version="">
            <instance name="I2C1">
               <register-group address-space="periph0" name="I2C" name-in-module="I2C" offset="0x1f801500" />
               <parameters>
                  <param name="" />
               </parameters>
            </instance>
            <instance name="I2C2">
               <parameters>
                  <param name="" />
               </parameters>
            </instance>
            <instance name="I2C3">
               <parameters>
                  <param name="" />
               </parameters>
            </instance>
         </module>
         <module id="02922" name="INT" version="">
            <instance name="INT">
               <register-group address-space="periph0" name="INT" name-in-module="INT" offset="0x1f802910" />
               <parameters>
                  <param name="" />
               </parameters>
            </instance>
         </module>
         <module id="02695" name="NVM" version="">
            <instance name="NVM">
               <register-group address-space="periph0" name="NVM" name-in-module="NVM" offset="0x1f802930" />
               <parameters>
                  <param name="PAGE_SIZE" value="2048" />
                  <param name="ROW_SIZE" value="256" />
               </parameters>
            </instance>
         </module>
         <module id="02823" name="RCON" version="">
            <instance name="RCON">
               <register-group address-space="periph0" name="RCON" name-in-module="RCON" offset="0x1f802680" />
               <parameters>
                  <param name="" />
               </parameters>
            </instance>
         </module>
         <module id="02050" name="RTCC" version="">
            <instance name="RTCC">
               <register-group address-space="periph0" name="RTCC" name-in-module="RTCC" offset="0x1f800000" />
               <parameters>
                  <param name="" />
               </parameters>
            </instance>
         </module>
         <module id="01329" name="SPI" version="">
            <instance name="SPI1">
               <register-group address-space="periph1" name="SPI" name-in-module="SPI" offset="0x1f808100" />
               <parameters>
                  <param name="" />
               </parameters>
            </instance>
            <instance name="SPI2">
               <parameters>
                  <param name="" />
               </parameters>
            </instance>
            <instance name="SPI3">
               <parameters>
                  <param name="" />
               </parameters>
            </instance>
         </module>
         <module id="02141" name="TMR1" version="">
            <instance name="TMR1">
               <register-group address-space="periph1" name="TMR1" name-in-module="TMR1" offset="0x1f808000" />
               <parameters>
                  <param name="" />
               </parameters>
            </instance>
         </module>
         <module id="00745" name="TMR" version="">
            <instance name="TMR2">
               <register-group address-space="periph1" name="TMR" name-in-module="TMR" offset="0x1f808040" />
               <parameters>
                  <param name="" />
               </parameters>
            </instance>
            <instance name="TMR3">
               <parameters>
                  <param name="" />
               </parameters>
            </instance>
         </module>
         <module id="02478" name="UART" version="">
            <instance name="UART1">
               <register-group address-space="periph0" name="UART" name-in-module="UART" offset="0x1f801800" />
               <parameters>
                  <param name="" />
               </parameters>
            </instance>
