Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MM_GPM_DFP/1.3.50/atdf/PIC32MM0064GPM028.atdf
         <register caption="" name="RPOR0" offset="0x200" rw="RW" size="4">
            <bitfield caption="" mask="0x0000001F" name="RP1R" />
            <bitfield caption="" mask="0x00001F00" name="RP2R" />
            <bitfield caption="" mask="0x001F0000" name="RP3R" />
            <bitfield caption="" mask="0x1F000000" name="RP4R" />
         </register>
         <register caption="" name="RPOR1" offset="0x210" rw="RW" size="4">
            <bitfield caption="" mask="0x0000001F" name="RP5R" />
            <bitfield caption="" mask="0x00001F00" name="RP6R" />
            <bitfield caption="" mask="0x001F0000" name="RP7R" />
            <bitfield caption="" mask="0x1F000000" name="RP8R" />
         </register>
         <register caption="" name="RPOR2" offset="0x220" rw="RW" size="4">
            <bitfield caption="" mask="0x0000001F" name="RP9R" />
            <bitfield caption="" mask="0x00001F00" name="RP10R" />
            <bitfield caption="" mask="0x001F0000" name="RP11R" />
            <bitfield caption="" mask="0x1F000000" name="RP12R" />
         </register>
         <register caption="" name="RPOR3" offset="0x230" rw="RW" size="4">
            <bitfield caption="" mask="0x0000001F" name="RP13R" />
            <bitfield caption="" mask="0x00001F00" name="RP14R" />
            <bitfield caption="" mask="0x001F0000" name="RP15R" />
            <bitfield caption="" mask="0x1F000000" name="RP16R" />
         </register>
         <register caption="" name="RPOR4" offset="0x240" rw="RW" size="4">
            <bitfield caption="" mask="0x0000001F" name="RP17R" />
            <bitfield caption="" mask="0x00001F00" name="RP18R" />
            <bitfield caption="" mask="0x001F0000" name="RP19R" />
            <bitfield caption="" mask="0x1F000000" name="RP20R" />
         </register>
         <register caption="" name="RPOR5" offset="0x250" rw="RW" size="4">
            <bitfield caption="" mask="0x0000001F" name="RP21R" />
            <bitfield caption="" mask="0x00001F00" name="RP22R" />
            <bitfield caption="" mask="0x001F0000" name="RP23R" />
            <bitfield caption="" mask="0x1F000000" name="RP24R" />
         </register>
         <register caption="" name="ANSELA" offset="0x2a0" rw="RW" size="4">
            <bitfield caption="" mask="0x00000001" name="ANSA0" />
            <bitfield caption="" mask="0x00000002" name="ANSA1" />
            <bitfield caption="" mask="0x00000004" name="ANSA2" />
            <bitfield caption="" mask="0x00000008" name="ANSA3" />
         </register>
         <register caption="" name="TRISA" offset="0x2b0" rw="RW" size="4">
            <bitfield caption="" mask="0x00000001" name="TRISA0" />
            <bitfield caption="" mask="0x00000002" name="TRISA1" />
            <bitfield caption="" mask="0x00000004" name="TRISA2" />
            <bitfield caption="" mask="0x00000008" name="TRISA3" />
            <bitfield caption="" mask="0x00000010" name="TRISA4" />
         </register>
         <register caption="" name="PORTA" offset="0x2c0" rw="RW" size="4">
            <bitfield caption="" mask="0x00000001" name="RA0" />
            <bitfield caption="" mask="0x00000002" name="RA1" />
            <bitfield caption="" mask="0x00000004" name="RA2" />
            <bitfield caption="" mask="0x00000008" name="RA3" />
            <bitfield caption="" mask="0x00000010" name="RA4" />
         </register>
         <register caption="" name="LATA" offset="0x2d0" rw="RW" size="4">
            <bitfield caption="" mask="0x00000001" name="LATA0" />
            <bitfield caption="" mask="0x00000002" name="LATA1" />
            <bitfield caption="" mask="0x00000004" name="LATA2" />
            <bitfield caption="" mask="0x00000008" name="LATA3" />
            <bitfield caption="" mask="0x00000010" name="LATA4" />
         </register>
         <register caption="" name="ODCA" offset="0x2e0" rw="RW" size="4">
            <bitfield caption="" mask="0x00000001" name="ODCA0" />
            <bitfield caption="" mask="0x00000002" name="ODCA1" />
            <bitfield caption="" mask="0x00000004" name="ODCA2" />
            <bitfield caption="" mask="0x00000008" name="ODCA3" />
            <bitfield caption="" mask="0x00000010" name="ODCA4" />
         </register>
         <register caption="" name="CNPUA" offset="0x2f0" rw="RW" size="4">
            <bitfield caption="" mask="0x00000001" name="CNPUA0" />
            <bitfield caption="" mask="0x00000002" name="CNPUA1" />
            <bitfield caption="" mask="0x00000004" name="CNPUA2" />
            <bitfield caption="" mask="0x00000008" name="CNPUA3" />
            <bitfield caption="" mask="0x00000010" name="CNPUA4" />
         </register>
         <register caption="" name="CNPDA" offset="0x300" rw="RW" size="4">
            <bitfield caption="" mask="0x00000001" name="CNPDA0" />
            <bitfield caption="" mask="0x00000002" name="CNPDA1" />
            <bitfield caption="" mask="0x00000004" name="CNPDA2" />
            <bitfield caption="" mask="0x00000008" name="CNPDA3" />
            <bitfield caption="" mask="0x00000010" name="CNPDA4" />
         </register>
         <register caption="" name="CNCONA" offset="0x310" rw="RW" size="4">
            <bitfield caption="" mask="0x00000400" name="PORT32" />
            <bitfield caption="" mask="0x00000800" name="CNSTYLE" />
            <bitfield caption="" mask="0x00008000" name="ON" />
         </register>
         <register caption="" name="CNEN0A" offset="0x320" rw="RW" size="4">
            <bitfield caption="" mask="0x00000001" name="CNIE0A0" />
            <bitfield caption="" mask="0x00000002" name="CNIE0A1" />
            <bitfield caption="" mask="0x00000004" name="CNIE0A2" />
            <bitfield caption="" mask="0x00000008" name="CNIE0A3" />
            <bitfield caption="" mask="0x00000010" name="CNIE0A4" />
         </register>
         <register caption="" name="CNSTATA" offset="0x330" rw="RW" size="4">
            <bitfield caption="" mask="0x00000001" name="CNSTATA0" />
            <bitfield caption="" mask="0x00000002" name="CNSTATA1" />
            <bitfield caption="" mask="0x00000004" name="CNSTATA2" />
            <bitfield caption="" mask="0x00000008" name="CNSTATA3" />
            <bitfield caption="" mask="0x00000010" name="CNSTATA4" />
         </register>
         <register caption="" name="CNEN1A" offset="0x340" rw="RW" size="4">
            <bitfield caption="" mask="0x00000001" name="CNIE1A0" />
            <bitfield caption="" mask="0x00000002" name="CNIE1A1" />
            <bitfield caption="" mask="0x00000004" name="CNIE1A2" />
            <bitfield caption="" mask="0x00000008" name="CNIE1A3" />
            <bitfield caption="" mask="0x00000010" name="CNIE1A4" />
         </register>
         <register caption="" name="CNFA" offset="0x350" rw="RW" size="4">
            <bitfield caption="" mask="0x00000001" name="CNFA0" />
            <bitfield caption="" mask="0x00000002" name="CNFA1" />
            <bitfield caption="" mask="0x00000004" name="CNFA2" />
            <bitfield caption="" mask="0x00000008" name="CNFA3" />
            <bitfield caption="" mask="0x00000010" name="CNFA4" />
         </register>
