Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MM_GPM_DFP/1.3.50/atdf/PIC32MM0064GPM028.atdf
         <register caption="" name="CNEN0B" offset="0x420" rw="RW" size="4">
            <bitfield caption="" mask="0x00000001" name="CNIE0B0" />
            <bitfield caption="" mask="0x00000002" name="CNIE0B1" />
            <bitfield caption="" mask="0x00000004" name="CNIE0B2" />
            <bitfield caption="" mask="0x00000008" name="CNIE0B3" />
            <bitfield caption="" mask="0x00000010" name="CNIE0B4" />
            <bitfield caption="" mask="0x00000020" name="CNIE0B5" />
            <bitfield caption="" mask="0x00000040" name="CNIE0B6" />
            <bitfield caption="" mask="0x00000080" name="CNIE0B7" />
            <bitfield caption="" mask="0x00000100" name="CNIE0B8" />
            <bitfield caption="" mask="0x00000200" name="CNIE0B9" />
            <bitfield caption="" mask="0x00000400" name="CNIE0B10" />
            <bitfield caption="" mask="0x00000800" name="CNIE0B11" />
            <bitfield caption="" mask="0x00002000" name="CNIE0B13" />
            <bitfield caption="" mask="0x00004000" name="CNIE0B14" />
            <bitfield caption="" mask="0x00008000" name="CNIE0B15" />
         </register>
         <register caption="" name="CNSTATB" offset="0x430" rw="RW" size="4">
            <bitfield caption="" mask="0x00000001" name="CNSTATB0" />
            <bitfield caption="" mask="0x00000002" name="CNSTATB1" />
            <bitfield caption="" mask="0x00000004" name="CNSTATB2" />
            <bitfield caption="" mask="0x00000008" name="CNSTATB3" />
            <bitfield caption="" mask="0x00000010" name="CNSTATB4" />
            <bitfield caption="" mask="0x00000020" name="CNSTATB5" />
            <bitfield caption="" mask="0x00000040" name="CNSTATB6" />
            <bitfield caption="" mask="0x00000080" name="CNSTATB7" />
            <bitfield caption="" mask="0x00000100" name="CNSTATB8" />
            <bitfield caption="" mask="0x00000200" name="CNSTATB9" />
            <bitfield caption="" mask="0x00000400" name="CNSTATB10" />
            <bitfield caption="" mask="0x00000800" name="CNSTATB11" />
            <bitfield caption="" mask="0x00002000" name="CNSTATB13" />
            <bitfield caption="" mask="0x00004000" name="CNSTATB14" />
            <bitfield caption="" mask="0x00008000" name="CNSTATB15" />
         </register>
         <register caption="" name="CNEN1B" offset="0x440" rw="RW" size="4">
            <bitfield caption="" mask="0x00000001" name="CNIE1B0" />
            <bitfield caption="" mask="0x00000002" name="CNIE1B1" />
            <bitfield caption="" mask="0x00000004" name="CNIE1B2" />
            <bitfield caption="" mask="0x00000008" name="CNIE1B3" />
            <bitfield caption="" mask="0x00000010" name="CNIE1B4" />
            <bitfield caption="" mask="0x00000020" name="CNIE1B5" />
            <bitfield caption="" mask="0x00000040" name="CNIE1B6" />
            <bitfield caption="" mask="0x00000080" name="CNIE1B7" />
            <bitfield caption="" mask="0x00000100" name="CNIE1B8" />
            <bitfield caption="" mask="0x00000200" name="CNIE1B9" />
            <bitfield caption="" mask="0x00000400" name="CNIE1B10" />
            <bitfield caption="" mask="0x00000800" name="CNIE1B11" />
            <bitfield caption="" mask="0x00002000" name="CNIE1B13" />
            <bitfield caption="" mask="0x00004000" name="CNIE1B14" />
            <bitfield caption="" mask="0x00008000" name="CNIE1B15" />
         </register>
         <register caption="" name="CNFB" offset="0x450" rw="RW" size="4">
            <bitfield caption="" mask="0x00000001" name="CNFB0" />
            <bitfield caption="" mask="0x00000002" name="CNFB1" />
            <bitfield caption="" mask="0x00000004" name="CNFB2" />
            <bitfield caption="" mask="0x00000008" name="CNFB3" />
            <bitfield caption="" mask="0x00000010" name="CNFB4" />
            <bitfield caption="" mask="0x00000020" name="CNFB5" />
            <bitfield caption="" mask="0x00000040" name="CNFB6" />
            <bitfield caption="" mask="0x00000080" name="CNFB7" />
            <bitfield caption="" mask="0x00000100" name="CNFB8" />
            <bitfield caption="" mask="0x00000200" name="CNFB9" />
            <bitfield caption="" mask="0x00000400" name="CNFB10" />
            <bitfield caption="" mask="0x00000800" name="CNFB11" />
            <bitfield caption="" mask="0x00002000" name="CNFB13" />
            <bitfield caption="" mask="0x00004000" name="CNFB14" />
            <bitfield caption="" mask="0x00008000" name="CNFB15" />
         </register>
         <register caption="" name="SR0B" offset="0x460" rw="RW" size="4" />
         <register caption="" name="SR1B" offset="0x470" rw="RW" size="4" />
         <register caption="" name="ANSELC" offset="0x4a0" rw="RW" size="4" />
         <register caption="" name="TRISC" offset="0x4b0" rw="RW" size="4">
            <bitfield caption="" mask="0x00000200" name="TRISC9" />
         </register>
         <register caption="" name="PORTC" offset="0x4c0" rw="RW" size="4">
            <bitfield caption="" mask="0x00000200" name="RC9" />
         </register>
         <register caption="" name="LATC" offset="0x4d0" rw="RW" size="4">
            <bitfield caption="" mask="0x00000200" name="LATC9" />
         </register>
         <register caption="" name="ODCC" offset="0x4e0" rw="RW" size="4">
            <bitfield caption="" mask="0x00000200" name="ODCC9" />
         </register>
         <register caption="" name="CNPUC" offset="0x4f0" rw="RW" size="4">
            <bitfield caption="" mask="0x00000200" name="CNPUC9" />
         </register>
         <register caption="" name="CNPDC" offset="0x500" rw="RW" size="4">
            <bitfield caption="" mask="0x00000200" name="CNPDC9" />
         </register>
         <register caption="" name="CNCONC" offset="0x510" rw="RW" size="4">
            <bitfield caption="" mask="0x00000400" name="PORT32" />
            <bitfield caption="" mask="0x00000800" name="CNSTYLE" />
            <bitfield caption="" mask="0x00008000" name="ON" />
         </register>
