Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MM_GPM_DFP/1.3.50/atdf/PIC32MM0064GPM028.atdf
         <register caption="" name="CNEN0C" offset="0x520" rw="RW" size="4">
            <bitfield caption="" mask="0x00000200" name="CNIE0C9" />
         </register>
         <register caption="" name="CNSTATC" offset="0x530" rw="RW" size="4">
            <bitfield caption="" mask="0x00000200" name="CNSTATC9" />
         </register>
         <register caption="" name="CNEN1C" offset="0x540" rw="RW" size="4">
            <bitfield caption="" mask="0x00000200" name="CNIE1C9" />
         </register>
         <register caption="" name="CNFC" offset="0x550" rw="RW" size="4">
            <bitfield caption="" mask="0x00000200" name="CNFC9" />
         </register>
         <register caption="" name="SR0C" offset="0x560" rw="R" size="4" />
         <register caption="" name="SR1C" offset="0x570" rw="R" size="4" />
      </register-group>
   </module>
   <module caption="" id="02511" name="HLVD" version="">
      <register-group name="HLVD">
         <register caption="High/Low-Voltage Detect Control Register" name="HLVDCON" offset="0x0" rw="RW" size="4">
            <bitfield caption="High/Low-Voltage Detection Limit Select bits" mask="0x0000000F" name="HLVDL" values="HLVDCON__HLVDL" />
            <bitfield caption="High/Low-Voltage Detection Event Status bit" mask="0x00000100" name="HLVDET" values="HLVDCON__HLVDET" />
            <bitfield caption="Internal Reference Voltage Stable Status bit" mask="0x00000200" name="IRVST" values="HLVDCON__IRVST" />
            <bitfield caption="Band Gap Reference Voltages Stable Status bit" mask="0x00000400" name="BGVST" values="HLVDCON__BGVST" />
            <bitfield caption="Voltage Change Direction Select bit" mask="0x00000800" name="VDIR" values="HLVDCON__VDIR" />
            <bitfield caption="" mask="0x00002000" name="SIDL" />
            <bitfield caption="HLVD Module Enable bit" mask="0x00008000" name="ON" values="HLVDCON__ON" />
         </register>
      </register-group>
      <value-group caption="High/Low-Voltage Detection Limit Select bits" name="HLVDCON__HLVDL">
         <value caption="External LVDIN pin" name="" value="0xf" />
         <value caption="VDD trip point is between 2.00V and 2.22V" name="" value="0xe" />
         <value caption="VDD trip point is between 2.08V and 2.33V" name="" value="0xd" />
         <value caption="VDD trip point is between 2.15V and 2.44V" name="" value="0xc" />
         <value caption="VDD trip point is between 2.25V and 2.55V" name="" value="0xb" />
         <value caption="VDD trip point is between 2.35V and 2.69V" name="" value="0xa" />
         <value caption="VDD trip point is between 2.45V and 2.80V" name="" value="0x9" />
         <value caption="VDD trip point is between 2.65V and 2.98V" name="" value="0x8" />
         <value caption="VDD trip point is between 2.75V and 3.09V" name="" value="0x7" />
         <value caption="VDD trip point is between 2.95V and 3.30V" name="" value="0x6" />
         <value caption="VDD trip point is between 3.25V and 3.63V" name="" value="0x5" />
         <value caption="Reserved; do not use" name="" value="0x4" />
         <value caption="Reserved; do not use" name="" value="0x3" />
         <value caption="Reserved; do not use" name="" value="0x2" />
         <value caption="Reserved; do not use" name="" value="0x1" />
         <value caption="Reserved; do not use" name="" value="0x0" />
      </value-group>
      <value-group caption="High/Low-Voltage Detection Event Status bit" name="HLVDCON__HLVDET">
         <value caption="Indicates HLVD Event interrupt is active" name="" value="0x1" />
         <value caption="Indicates HLVD Event interrupt is not active" name="" value="0x0" />
      </value-group>
      <value-group caption="Internal Reference Voltage Stable Status bit" name="HLVDCON__IRVST">
         <value caption="Indicates internal reference voltage references is stable" name="" value="0x1" />
         <value caption="Indicates internal reference voltage reference is not stable" name="" value="0x0" />
      </value-group>
      <value-group caption="Band Gap Reference Voltages Stable Status bit" name="HLVDCON__BGVST">
         <value caption="Indicates internal band gap voltage references is stable" name="" value="0x1" />
         <value caption="Indicates internal band gap voltage reference is not stable" name="" value="0x0" />
      </value-group>
      <value-group caption="Voltage Change Direction Select bit" name="HLVDCON__VDIR">
         <value caption="Event occurs when voltage equals or exceeds the trip point (HLVDL)" name="" value="0x1" />
         <value caption="Event occurs when voltage equals or falls below the trip point (HLVDL)" name="" value="0x0" />
      </value-group>
      <value-group caption="HLVD Module Enable bit" name="HLVDCON__ON">
         <value caption="HLVD module is enabled" name="" value="0x1" />
         <value caption="HLVD module is disabled" name="" value="0x0" />
      </value-group>
   </module>
   <module caption="" id="01441" name="I2C" version="">
      <register-group name="I2C">
         <register caption="" name="I2C1CON" offset="0x0" rw="RW" size="4">
            <bitfield caption="Start Condition Enable bit (when operating as I2C master)" mask="0x00000001" name="SEN" values="I2C1CON__SEN" />
            <bitfield caption="Repeated Start Condition Enable bit (when operating as I2C master)" mask="0x00000002" name="RSEN" values="I2C1CON__RSEN" />
            <bitfield caption="Stop Condition Enable bit (when operating as I2C master)" mask="0x00000004" name="PEN" values="I2C1CON__PEN" />
            <bitfield caption="Receive Enable bit (when operating as I2C master)" mask="0x00000008" name="RCEN" values="I2C1CON__RCEN" />
            <bitfield caption="Acknowledge Sequence Enable bit" mask="0x00000010" name="ACKEN" values="I2C1CON__ACKEN" />
            <bitfield caption="Acknowledge Data bit (when operating as I2C master, applicable during master receive)" mask="0x00000020" name="ACKDT" values="I2C1CON__ACKDT" />
            <bitfield caption="SCLx Clock Stretch Enable bit (when operating as I2C slave)" mask="0x00000040" name="STREN" values="I2C1CON__STREN" />
            <bitfield caption="General Call Enable bit (when operating as I2C slave)" mask="0x00000080" name="GCEN" values="I2C1CON__GCEN" />
            <bitfield caption="SMBus Input Levels bit" mask="0x00000100" name="SMEN" values="I2C1CON__SMEN" />
            <bitfield caption="Disable Slew Rate Control bit" mask="0x00000200" name="DISSLW" values="I2C1CON__DISSLW" />
            <bitfield caption="10-bit Slave Address bit" mask="0x00000400" name="A10M" values="I2C1CON__A10M" />
            <bitfield caption="Strict I 2 C Reserved Address Rule Enable bit" mask="0x00000800" name="STRICT" values="I2C1CON__STRICT" />
            <bitfield caption="SCLx Release Control bit (when operating as I2C slave)" mask="0x00001000" name="SCLREL" values="I2C1CON__SCLREL" />
            <bitfield caption="Stop in Idle Mode bit" mask="0x00002000" name="SIDL" values="I2C1CON__SIDL" />
            <bitfield caption="I2C Enable bit" mask="0x00008000" name="ON" values="I2C1CON__ON" />
            <bitfield caption="" mask="0x00040000" name="SBCDE" values="I2C1CON__SBCDE" />
            <bitfield caption="" mask="0x00080000" name="SDAHT" values="I2C1CON__SDAHT" />
            <bitfield caption="" mask="0x00100000" name="BOEN" values="I2C1CON__BOEN" />
            <bitfield caption="" mask="0x00200000" name="SCIE" values="I2C1CON__SCIE" />
            <bitfield caption="" mask="0x00400000" name="PCIE" values="I2C1CON__PCIE" />
         </register>
