Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MM_GPM_DFP/1.3.50/atdf/PIC32MM0064GPM028.atdf
      <value-group caption="Transmit Audio Data Format bit" name="SPI2CON2__AUDMONO">
         <value caption="Audio data is mono (Each data word is transmitted on both left and right channels)" name="" value="0x1" />
         <value caption="Audio data is stereo" name="" value="0x0" />
      </value-group>
      <value-group caption="Enable Audio CODEC Support bit" name="SPI2CON2__AUDEN">
         <value caption="Audio protocol enabled" name="" value="0x1" />
         <value caption="Audio protocol disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Ignore Transmit Underrun bit" name="SPI2CON2__IGNTUR">
         <value caption="A TUR is not a critical error and zeros are transmitted until the SPIxTXB is not empty" name="" value="0x1" />
         <value caption="A TUR is a critical error which stop SPI operation" name="" value="0x0" />
      </value-group>
      <value-group caption="Ignore Receive Overflow bit" name="SPI2CON2__IGNROV">
         <value caption="A ROV is not a critical error; during ROV data in the fifo is not overwritten by receive data" name="" value="0x1" />
         <value caption="A ROV is a critical error which stop SPI operation" name="" value="0x0" />
      </value-group>
      <value-group caption="Enable Interrupt Events via SPITUR bit" name="SPI2CON2__SPITUREN">
         <value caption="Transmit Underrun Generates Error Events" name="" value="0x1" />
         <value caption="Transmit Underrun Does Not Generates Error Events" name="" value="0x0" />
      </value-group>
      <value-group caption="Enable Interrupt Events via SPIROV bit" name="SPI2CON2__SPIROVEN">
         <value caption="Receive overflow generates error events" name="" value="0x1" />
         <value caption="Receive overflow does not generate error events" name="" value="0x0" />
      </value-group>
      <value-group caption="Enable Interrupt Events via FRMERR bit" name="SPI2CON2__FRMERREN">
         <value caption="Frame Error overflow generates error events" name="" value="0x1" />
         <value caption="Frame Error does not generate error events" name="" value="0x0" />
      </value-group>
      <value-group caption="Sign Extend Read Data from the RX FIFO bit" name="SPI2CON2__SPISGNEXT">
         <value caption="Data from RX FIFO is sign extended" name="" value="0x1" />
         <value caption="Data from RX FIFO is not sign extened" name="" value="0x0" />
      </value-group>
      <value-group caption="Audio Protocol Mode bit" name="SPI3CON2__AUDMOD">
         <value caption="PCM/DSP mode" name="" value="0x3" />
         <value caption="Right Justified mode" name="" value="0x2" />
         <value caption="Left Justified mode" name="" value="0x1" />
         <value caption="I2S mode" name="" value="0x0" />
      </value-group>
      <value-group caption="Transmit Audio Data Format bit" name="SPI3CON2__AUDMONO">
         <value caption="Audio data is mono (Each data word is transmitted on both left and right channels)" name="" value="0x1" />
         <value caption="Audio data is stereo" name="" value="0x0" />
      </value-group>
      <value-group caption="Enable Audio CODEC Support bit" name="SPI3CON2__AUDEN">
         <value caption="Audio protocol enabled" name="" value="0x1" />
         <value caption="Audio protocol disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Ignore Transmit Underrun bit" name="SPI3CON2__IGNTUR">
         <value caption="A TUR is not a critical error and zeros are transmitted until the SPIxTXB is not empty" name="" value="0x1" />
         <value caption="A TUR is a critical error which stop SPI operation" name="" value="0x0" />
      </value-group>
      <value-group caption="Ignore Receive Overflow bit" name="SPI3CON2__IGNROV">
         <value caption="A ROV is not a critical error; during ROV data in the fifo is not overwritten by receive data" name="" value="0x1" />
         <value caption="A ROV is a critical error which stop SPI operation" name="" value="0x0" />
      </value-group>
      <value-group caption="Enable Interrupt Events via SPITUR bit" name="SPI3CON2__SPITUREN">
         <value caption="Transmit Underrun Generates Error Events" name="" value="0x1" />
         <value caption="Transmit Underrun Does Not Generates Error Events" name="" value="0x0" />
      </value-group>
      <value-group caption="Enable Interrupt Events via SPIROV bit" name="SPI3CON2__SPIROVEN">
         <value caption="Receive overflow generates error events" name="" value="0x1" />
         <value caption="Receive overflow does not generate error events" name="" value="0x0" />
      </value-group>
      <value-group caption="Enable Interrupt Events via FRMERR bit" name="SPI3CON2__FRMERREN">
         <value caption="Frame Error overflow generates error events" name="" value="0x1" />
         <value caption="Frame Error does not generate error events" name="" value="0x0" />
      </value-group>
      <value-group caption="Sign Extend Read Data from the RX FIFO bit" name="SPI3CON2__SPISGNEXT">
         <value caption="Data from RX FIFO is sign extended" name="" value="0x1" />
         <value caption="Data from RX FIFO is not sign extened" name="" value="0x0" />
      </value-group>
   </module>
   <module caption="" id="02141" name="TMR1" version="2">
      <register-group name="TMR1">
         <register caption="TYPE A TIMER CONTROL REGISTER" name="T1CON" offset="0x0" rw="RW" size="4">
            <bitfield caption="Timer Clock Source Select bit" mask="0x00000002" name="TCS" values="T1CON__TCS" />
            <bitfield caption="Timer External Clock Input Synchronization Selection bit" mask="0x00000004" name="TSYNC" values="T1CON__TSYNC" />
            <bitfield caption="Timer Input Clock Prescale Select bits" mask="0x00000030" name="TCKPS" values="T1CON__TCKPS" />
            <bitfield caption="Timer Gated Time Accumulation Enable bit" mask="0x00000080" name="TGATE" values="T1CON__TGATE" />
            <bitfield caption="Timer1 External Clock Selection bits" mask="0x00000300" name="TECS" values="T1CON__TECS" />
            <bitfield caption="Asynchronous Timer Write in Progress bit" mask="0x00000800" name="TWIP" values="T1CON__TWIP" />
            <bitfield caption="Asynchronous Timer Write Disable bit" mask="0x00001000" name="TWDIS" values="T1CON__TWDIS" />
            <bitfield caption="Stop in Idle Mode bit" mask="0x00002000" name="SIDL" values="T1CON__SIDL" />
            <bitfield caption="Timer On bit" mask="0x00008000" name="ON" values="T1CON__ON" />
         </register>
         <register caption="" name="TMR1" offset="0x10" rw="RW" size="4">
            <bitfield caption="" mask="0xFFFFFFFF" name="TMR1" />
         </register>
